MarcoBodega/MeteoStation-STM32/Demo/main.c
//
// This file is part of the GNU ARM Eclipse distribution.
// Copyright (c) 2014 Liviu Ionescu.
//

// ----------------------------------------------------------------------------

//#include <stdio.h>
//#include <stdlib.h>
//#include <string.h>
//#include "diag/Trace.h"
//#include "Timer.h"

#include "uart.h"
#include <stm32f10x.h>



// ----- Timing definitions -------------------------------------------------

//#define TICKS  (TIMER_FREQUENCY_HZ )

// ----------------------------------------------------------------------------
//
// Standalone STM32F1 empty sample (trace via STDOUT).
//
// Trace support is enabled by adding the TRACE macro definition.
// By default the trace messages are forwarded to the STDOUT output,
// but can be rerouted to any device or completely suppressed, by
// changing the definitions required in system/src/diag/trace_impl.c
// (currently OS_USE_TRACE_ITM, OS_USE_TRACE_SEMIHOSTING_DEBUG/_STDOUT).
//

// ----- main() ---------------------------------------------------------------

// Sample pragmas to cope with warnings. Please note the related line at
// the end of this function, used to pop the compiler diagnostics status.
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-parameter"
#pragma GCC diagnostic ignored "-Wmissing-declarations"
#pragma GCC diagnostic ignored "-Wreturn-type"

// USART CONF
#define myUSART 1
#define espUSART 2

// WIFI CONF
#define WIFI_NET ""
#define WIFI_PWD ""

// THINGSPEAK CONF
#define THGSPK_APIKEY ""
#define THGSPK_KEY1 "field1" //"temp"
#define THGSPK_KEY2 "field2" //"hum"
#define THGSPK_KEY3 "field3" //"mq2"
#define THGSPK_CNT_UPDATE 10
#define THGSPK_PORT "80" //"443"

uint8_t buf[QUEUE_SIZE];
uint8_t nbyte = 32; //size_t

uint8_t cmd[16];
uint8_t cmdi; //size_t

uint8_t cmd_feedback[32];

uint8_t out_esp[80];
uint8_t out_size[5];
uint8_t out[32];
uint8_t tmp[16];

uint8_t temp_last[5];
uint8_t hum_last[5];
uint8_t mq2_last[5];

uint32_t ticks = 0;
GPIO_InitTypeDef GPIO_InitStructure ;
uint8_t getValueFromOnes(uint8_t start, uint8_t to);
void ADC_Calibrate();


typedef enum { 
	AT_READY,
	AT,
	AT_GMR,
	AT_CWMODE,
	AT_CWLAP,
	AT_CWJAP,
	AT_CIFSR,
	AT_DONE,
	AT_READY2SND,
	AT_ERROR,
	AT_THGSPK_CON,
	AT_THGSPK_SIZE,
	AT_THGSPK_PAYLD,
} AT_STATE; 

uint8_t mode_conf_wifi_boot = 0; 
uint8_t mode_conf_wifi_user = 0; 
uint8_t mode_wifi_working = 0;
AT_STATE wifi_state;
void initWifi();
void prepSendWifi() ;
uint8_t count_thgspk = 0;
uint8_t mode_wifi_already_conn = 0;

// avoid newlib
int strlen(char *s);
int strcmp(const char* s1, const char* s2);
char *strcpy(char *dst, char *src);
char *strcat(char *dest, const char *src) ;
void get_dec_str (uint8_t* str, uint8_t len, uint32_t val);
void itoa(char *buf, int base, int d);

uint8_t ri;



int main(int argc, char* argv[])
{

	RCC_APB2PeriphClockCmd (  RCC_APB2Periph_GPIOA  | RCC_APB2Periph_USART1 | RCC_APB2Periph_ADC1 |  RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO, ENABLE);
	RCC_APB1PeriphClockCmd ( RCC_APB1Periph_TIM3 | RCC_APB1Periph_USART2 , ENABLE );

	// Configure the NVIC to enable interrupt channel TIM3_IRQn  with the
	// highest priority (0 for both sub-priority and preemption priority)
	// ONLY TIM1 can be split in TIM1_CC_IRQn and TIM1_UP_IRQn
	NVIC_InitTypeDef NVIC_InitStructure ;
	NVIC_InitStructure . NVIC_IRQChannel = TIM3_IRQn;
	NVIC_InitStructure . NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure . NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure . NVIC_IRQChannelCmd = ENABLE ;
	NVIC_Init (& NVIC_InitStructure );

	// Configure the NVIC to enable interrupt channel ADC1_IRQn with the
	// highest priority (0 for both sub-priority and preemption priority)
	NVIC_InitStructure . NVIC_IRQChannel = ADC1_IRQn ;
	NVIC_InitStructure . NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure . NVIC_IRQChannelPreemptionPriority = 3;
	NVIC_InitStructure . NVIC_IRQChannelCmd = ENABLE ;
	NVIC_Init (& NVIC_InitStructure );

	// PWM input DH11 sensor
	GPIO_StructInit (& GPIO_InitStructure );
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 ;  // TIM3_CH1: STM32VL PA6 , on olimex PC6 -> PC4 (really)
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD ; // OpenDrain!!
	GPIO_Init (GPIOA , & GPIO_InitStructure );
	// no remap needed	//GPIO_PinRemapConfig(GPIO_FullRemap_TIM3, ENABLE);

	//debug test points (oscilloscope)
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11 | GPIO_Pin_10; // on olimex PC8-9 (9 is under 8) (really)
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP ;
	GPIO_Init (GPIOC , & GPIO_InitStructure );

	//ADC_IN6  (MQ2 sensor - 5V)
	GPIO_StructInit (& GPIO_InitStructure );
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 ; //STM32VL PA1  // on olimex PA6 is under PA4
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN ;
	GPIO_Init (GPIOA , & GPIO_InitStructure );

	// ADC init
	ADC_InitTypeDef	 ADC_InitStructure;
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent ;
	ADC_InitStructure.ADC_ScanConvMode = DISABLE ;
	ADC_InitStructure.ADC_ContinuousConvMode = DISABLE ; //DISABLE ;
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T3_TRGO; //ADC_ExternalTrigConv_T3_TRGO ;
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right ;
	ADC_InitStructure.ADC_NbrOfChannel = 1;
	ADC_Init (ADC1 , & ADC_InitStructure );

	// Configure ADC_IN1
	ADC_RegularChannelConfig (ADC1 , ADC_Channel_1 , 1, ADC_SampleTime_55Cycles5 ); //ADC_SampleTime_55Cycles5 );

	// ADC Trigger
	ADC_ITConfig (ADC1 , ADC_IT_EOC , ENABLE );
	ADC_ExternalTrigConvCmd (ADC1 , ENABLE );

	ADC_Cmd (ADC1 , ENABLE );
	//calibration
	ADC_Calibrate();

	// configure timer TIM3 for tick every 1ms
	// PWM frequency = 100 hz with 72,000,000 hz system clock
	// 72,000,000/720 = 100,000
	// 100,000/100 = 1000
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure ;
	TIM_TimeBaseStructInit (& TIM_TimeBaseStructure );
	TIM_TimeBaseStructure.TIM_Prescaler = 240 -1; //on olimex 720
	TIM_TimeBaseStructure.TIM_Period = 100 -1;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up ;
	TIM_TimeBaseInit (TIM3 , & TIM_TimeBaseStructure );
	TIM_SelectOutputTrigger (TIM3 , TIM_TRGOSource_Update );

	/* TIM3 configuration: PWM Input mode ------------------------
	The external signal is connected to TIM3 CH1 pin
	The Rising edge is used as active edge,
	The TIM3 CCR1 is used to compute the frequency value
	The TIM3 CCR2 is used to compute the duty cycle value
	----------------------------------------------------------- */
	TIM_ICInitTypeDef  TIM_ICInitStructure;
	TIM_ICInitStructure.TIM_Channel = TIM_Channel_1;
	TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising; //TIM_ICPolarity_Falling;
	TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
	TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	TIM_ICInitStructure.TIM_ICFilter = 0x0;
	TIM_PWMIConfig(TIM3, &TIM_ICInitStructure);
	TIM_SelectInputTrigger(TIM3, TIM_TS_TI1FP1); 	// Select the TIM3 Input Trigger: TIM_TS_TI2FP2
	TIM_SelectSlaveMode(TIM3, TIM_SlaveMode_Reset); // Select the slave Mode: Reset Mode
	TIM_SelectMasterSlaveMode(TIM3, TIM_MasterSlaveMode_Enable);	// Enable the Master/Slave Mode

	
