MarcoBodega/MeteoStation-STM32/Demo/main.c
	// open DEBUG console
	uart_open(myUSART, 115200, 0);

	// welcome
	uart_write(myUSART, "\n\n\r############################\r\n", strlen("\n\n\r############################\r\n"));
	uart_write(myUSART, "Welcome to the MeteoStation!\r\n", strlen("Welcome to the MeteoStation!\r\n"));
	uart_write(myUSART, "############################\r\n", strlen("############################\r\n"));

	//WIP
	initWifi() ;
        
	GPIO_WriteBit(GPIOA, GPIO_Pin_6, Bit_RESET);

	TIM_Cmd (TIM3 , ENABLE ); 	// Enable the tick timer
	TIM_ITConfig (TIM3 , TIM_IT_Update , ENABLE ); 	// Enable Timer Interrupt , enable timer

	// prompt
	uart_write(myUSART, "\r\n# ", strlen("\r\n# "));

	cmdi = 0;
	// Infinite loop
	while (1)
	{

		if(mode_conf_wifi_boot || mode_wifi_working) 
		{
		    // read
		    ri = uart_read(espUSART, buf, nbyte);

		    if(ri > 0) {

	            for(int j=0; j<ri; j++, cmdi++)
					cmd[cmdi] = buf[j];

				uart_write(myUSART, buf, ri);

	            // \r = 0x0A, \n = 0x0D
	            if(buf[ri-1] == '\n') {
                    //echo it back!!
                    
                    //uart_write(myUSART, buf, ri);

                    // remove \n\n
                    cmd[cmdi-2] = '\0';

					if(strcmp(cmd, "ready") == 0) {
						uart_write(myUSART, "esp8266 ready\r\n", strlen("esp8266 ready\r\n"));
						wifi_state = AT_READY;
						uart_write(espUSART, "AT\r\n", strlen("AT\r\n"));
					}
					if(strcmp(cmd, "CHECK FAIL!!!") == 0) {
						initWifi() ;
					}

                    if(strcmp(cmd, "OK") == 0) {
                    	//uart_write(myUSART, "Got OK from esp8266\r\n", strlen("Got OK from esp8266\r\n"));

                    	switch(wifi_state) {
							case AT_READY: 
								uart_write(myUSART, "AT OK\r\n", strlen("AT OK\r\n"));
								wifi_state = AT;
								uart_write(espUSART, "AT+GMR\r\n", strlen("AT+GMR\r\n"));
							break;
							case AT: 
								uart_write(myUSART, "AT+GMR OK\r\n", strlen("AT+GMR OK\r\n"));
								wifi_state = AT_GMR;
								uart_write(espUSART, "AT+CWMODE=3\r\n", strlen("AT+CWMODE=3\r\n"));
							break;
							case AT_GMR: 
								uart_write(myUSART, "AT_CWMODE OK\r\n", strlen("AT+CWMODE OK\r\n"));
								wifi_state = AT_CWMODE;
								uart_write(espUSART, "AT+CWLAP\r\n", strlen("AT+CWLAP\r\n"));
							break;
							case AT_CWMODE: 
								uart_write(myUSART, "AT+CWLAP OK\r\n", strlen("AT+CWLAP OK\r\n"));
								wifi_state = AT_CWLAP;
								uart_write(espUSART, "AT+CWJAP=\"" WIFI_NET "\",\"" WIFI_PWD "\"\r\n", strlen( "AT+CWJAP=\"" WIFI_NET "\",\"" WIFI_PWD "\"\r\n" ));
							break;
							case AT_CWLAP: 
								uart_write(myUSART, "AT+CWJAP OK\r\n", strlen("AT+CWJAP OK\r\n"));
								wifi_state = AT_CWJAP;
								uart_write(espUSART, "AT+CIFSR\r\n", strlen("AT+CIFSR\r\n"));
							break;
							case AT_CWJAP: 
								uart_write(myUSART, "AT+CIFSR OK\r\n", strlen("AT+CIFSR OK\r\n"));
								wifi_state = AT_CIFSR;
							case AT_CIFSR: 
								uart_write(myUSART, "WIFI configuration OK\r\n", strlen("WIFI configuration OK\r\n"));
								mode_conf_wifi_boot = 0;
								mode_wifi_working = 1;
								wifi_state = AT_DONE;
							break;	
							// WIFI configured now..
							// entry point of data sending/receiving
							// here somewhere somebody issued a AT+CIPSTART to talk to ThingSpeak!!
							case AT_DONE: 
							case AT_READY2SND:
								prepSendWifi() ;
							break;
							case AT_THGSPK_CON: 
								uart_write(myUSART, "AT+CIPSEND OK\r\n", strlen("AT+CIPSEND OK\r\n"));
								wifi_state = AT_THGSPK_SIZE;
								// we prepare out before...
								uart_write(myUSART, out_esp, strlen(out_esp));
								uart_write(espUSART, out_esp, strlen(out_esp));
							break;
							case AT_THGSPK_SIZE: 
								uart_write(myUSART, "GET /update? OK\r\n", strlen("GET /update? OK\r\n"));
								wifi_state = AT_THGSPK_PAYLD;
								//DONE IT
							case AT_THGSPK_PAYLD: 
								// be ready to POST next data!
								wifi_state = AT_DONE;
							break;
							
                    	}
                    }
                    /*
                	if(strcmp(cmd, "WIFI CONNECTED") == 0) {
                		//TODO
                		mode_conf_wifi_boot = 0;
                	}
					if(strcmp(cmd, "WIFI GOT IP") == 0) {
                		//TODO
                		mode_conf_wifi_boot = 0;
                	}
                	if(strcmp(cmd, "CONNECT") == 0) {
                		//TODO
                	}
                	if(strcmp(cmd, "Connection: close") == 0) {
                		wifi_state = AT_DONE;
                	}

                	if(strcmp(cmd, "Linked") == 0) {
                		//TODO
                	}
                	*/
                	if(strcmp(cmd, "ALREADY CONNECTED") == 0) {
                		uart_write(myUSART, "Got ALREADY CONNECTED from esp8266\r\n", strlen("Got ALREADY CONNECTED from esp8266\r\n"));
                		mode_wifi_already_conn = 1;
                		wifi_state = AT_READY2SND;
                	}
                	if(strcmp(cmd, "SEND OK") == 0) {
						//wifi_state = AT_READY2SND;
						// since we have always a CLOSED after (with no \r\n)
						wifi_state = AT_DONE;
					}
					if(strcmp(cmd, "CLOSED") == 0) {
						uart_write(myUSART, "Got CLOSED from esp8266\r\n", strlen("Got CLOSED from esp8266\r\n"));
                		// no \r\n.. not sure it works
                		//wifi_state = AT_READY2SND;
                		if(mode_wifi_already_conn == 1) 
                			wifi_state = AT_READY2SND;
                		else
                			wifi_state = AT_DONE;
                		mode_wifi_already_conn = 0;
                	}
                    if(strcmp(cmd, "ERROR") == 0) {
                            uart_write(myUSART, "Got ERROR from esp8266\r\n", strlen("Got ERROR from esp8266\r\n"));      
                            wifi_state = AT_ERROR;
                            mode_conf_wifi_boot = 0;
                            // REBOOT?
                            //initWifi();
                            //DISCONNECT!!
                		    //uart_write(espUSART, "\r\n\r\n", strlen("\r\n\r\n"));

                		    wifi_state = AT_DONE;
                    }	                    

                    // clean cmd
                    cmd[0] = '\0';
                    cmdi = 0;
	            }

