MarcoBodega/MeteoStation-STM32/Demo/main.c
	        }
	    }

		if(mode_conf_wifi_user) 
		{
		    // read
		    ri = uart_read(myUSART, buf, nbyte);

		    if(ri > 0) {

	            for(int j=0; j<ri; j++, cmdi++)
	                    cmd[cmdi] = buf[j];

	            // \r = 0x0A, \n = 0x0D
	            if(buf[ri-1] == '\r') {

                    //echo it back!!
                    ri++;
                    buf[ri-1] = '\n';
                    uart_write(myUSART, buf, ri);

                    // replace \r or \n with string end
                    cmd[cmdi-1] = '\0';

                    cmd_feedback[0] = '\0';
                    //TODO SAVE NET & PWD
                    if(strcmp(cmd, "WIFI_NET") == 0) {
                            strcpy(cmd_feedback,"Received WIFI_NET :) \n\r");
                    }
                    else if(strcmp(cmd, "WIFI_PWD") == 0) {
                            strcpy(cmd_feedback,"Received WIFI_PWD :) \n\r");
                            
                            //TODO - run initWifi(); with saved NET and PWD
                    }

                    if(strlen(cmd) > 0)
                            uart_write(myUSART, cmd_feedback, strlen(cmd_feedback));

                    // clean cmd
                    cmd[0] = '\0';
                    cmdi = 0;

                    // prompt
                    uart_write(myUSART, "# ", strlen("# "));
	            }
	            else {
	                    //echo it back!!
	                    uart_write(myUSART, buf, ri);
	            }
		    }
		}
	}
	uart_close(myUSART);
}


void initWifi() 
{
	mode_conf_wifi_boot = 1;

    // open esp8266 wifi uart	
	uart_open(espUSART, 115200, 0);

    GPIO_WriteBit(GPIOA, GPIO_Pin_0, Bit_RESET);  // <-- TEST
	uint32_t delay=15000;
	while(delay) delay--;
    GPIO_WriteBit(GPIOA, GPIO_Pin_0, Bit_SET);  // <-- TEST

}


void prepSendWifi() 
{
	uart_write(myUSART, "AT+CIPSTART OK\r\n", strlen("AT+CIPSTART OK\r\n"));
	wifi_state = AT_THGSPK_CON;
	// prepare string to send
		//uart_write(espUSART, "GET /update?api_key=" THGSPK_APIKEY "&" THGSPK_KEY1 "=va1&" THGSPK_KEY2 "=va2&" THGSPK_KEY3 "=val3\r\n", strlen("GET /update?api_key=" THGSPK_APIKEY "&" THGSPK_KEY1 "=va1&" THGSPK_KEY2 "=val2&" THGSPK_KEY3 "=val3\r\n"));
	out_esp[0] = '\0';
	strcpy(out_esp, "GET /update?api_key=" THGSPK_APIKEY "&" THGSPK_KEY1 "=");
	strcat(out_esp, temp_last);
	strcat(out_esp, "&" THGSPK_KEY2 "=");
	strcat(out_esp, hum_last);
	strcat(out_esp, "&" THGSPK_KEY3 "=");
	strcat(out_esp, mq2_last);
	strcat(out_esp, "\r\n");
	tmp[0] = '\0';
	strcpy(tmp, "AT+CIPSEND=");
	out_size[0] = '\0';
	itoa(out_size, 'd', strlen(out_esp)); 
	strcat(tmp, out_size);
	strcat(tmp, "\r\n");
	uart_write(espUSART, tmp, strlen(tmp));
	//uart_write(espUSART, "AT+CIPSEND=70\r\n", strlen("AT+CIPSEND=70\r\n"));

}



__IO uint16_t IC1Value = 0;
__IO uint16_t IC2Value = 0;
__IO uint16_t DutyCycle = 0;
__IO uint32_t Frequency = 0;


#define MAX 40
uint32_t freq_arr[MAX];
uint32_t dc_arr[MAX];
uint8_t Ones[MAX];

uint8_t cnt = 0;
uint8_t idx = 0;

uint8_t HUM_h;
uint8_t HUM_l;
uint8_t TEMP_h;
uint8_t TEMP_l;
uint8_t PARITY;

uint16_t mq2 = 0;

void TIM3_IRQHandler (void)
{

	if( TIM_GetFlagStatus (TIM3 , TIM_FLAG_CC1 ) == SET )
	{
		//GPIO_WriteBit(GPIOC, GPIO_Pin_10, Bit_SET);  // <-- TEST

		ADC_ITConfig (ADC1 , ADC_IT_EOC , DISABLE ); // disable ADC in this part

		TIM_ClearITPendingBit(TIM3, TIM_IT_CC1);
		IC1Value = TIM_GetCapture1(TIM3);
		IC2Value = TIM_GetCapture2(TIM3);

		if (IC2Value != 0 && IC1Value != 0)
		{
			//// Duty cycle computation
			DutyCycle = (IC2Value * 100) / IC1Value;
			//// Frequency computation
			// since it's rising edge.. it's related to the next bit... NOOO
			Frequency = SystemCoreClock / (IC1Value);

			// we remove part of the long low frame
			// and the spike when the MCU put the pin floating (or push it up)
			// and when thesensor initially put down for 80us
			// and then when the Sensor put level up for 80us (when you see ducycycle a little higher than bit 1)
			if(cnt >= 3) {

				freq_arr[idx] = Frequency;
				dc_arr[idx] = DutyCycle;

				////////// Theory /////////////////777
				// 1 should have DC = 58% and freq = 120 us
				// 0 should have DC = 34/36% and freq = 76/78 us
				////////// Practice ///////////////////7
				// 1 have DC = 56% and freq = 126/129 us
				// 0 have DC = 30/31% and freq = 80us
				// FREQUENCY READING IS WRONG!!! (it's inverted)

				if((DutyCycle >= 50 && DutyCycle <= 60) /*&& ( Frequency >= 12500 && Frequency <= 13100)*/) {
					Ones[idx] =	1;
				}
				else if ((DutyCycle >= 25 && DutyCycle <= 35) /*&& ( Frequency >= 7500 && Frequency <= 8500)*/) {
					Ones[idx] =	0;
				}
				else
					Ones[idx] =	2;  // DISCARD
				idx++;
			}
			cnt++;

			if(idx >= MAX) {
				cnt = 0;
				idx = 0;
				TIM_ITConfig(TIM3, TIM_IT_CC1, DISABLE);
				//GPIO_PinRemapConfig(GPIO_FullRemap_TIM3, DISABLE); // in Olimex is needed

				GPIO_WriteBit(GPIOA, GPIO_Pin_6, Bit_SET);
				TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);

				HUM_h = getValueFromOnes(0, 7);
				//HUM_l = getValueFromOnes(8, 15);  // all zeros in this sensor model
				TEMP_h = getValueFromOnes(16, 23);
				//TEMP_l = getValueFromOnes(24, 31); // all zeros in this sensor model
				PARITY = getValueFromOnes(32, 39);

				ADC_ITConfig (ADC1 , ADC_IT_EOC , ENABLE );  // enable ADC now :)
			}
		}
		else
		{
			DutyCycle = 0;
			Frequency = 0;
		}
		//GPIO_WriteBit(GPIOC, GPIO_Pin_10, Bit_RESET);  // <-- TEST
		return;
	}

	if( TIM_GetFlagStatus (TIM3 , TIM_FLAG_Update ) == SET )
	{
		//GPIO_WriteBit(GPIOC, GPIO_Pin_11, Bit_SET);  // <-- TEST
		TIM_ClearITPendingBit (TIM3 , TIM_IT_Update );

		ticks++;
		if(ticks == 18)
		{
			TIM_ITConfig (TIM3 , TIM_IT_Update , DISABLE );

			//GPIO_PinRemapConfig(GPIO_FullRemap_TIM3, ENABLE); // in Olimex is needed

			GPIO_WriteBit(GPIOA, GPIO_Pin_6, Bit_SET);
			TIM_ITConfig(TIM3, TIM_IT_CC1, ENABLE);
		}
		else if(ticks == 1000) {

			count_thgspk++;


			//trace_printf("HUM_h = %d, HUM_l = %d, TEMP_h = %d, TEMP_l = %d, PARITY = %d \n", HUM_h, HUM_l, TEMP_h, TEMP_l, PARITY);
			//trace_printf("HUM = %d, TEMP = %d° C, PARITY = %d \n", HUM_h,  TEMP_h,  PARITY);
			//trace_printf("HUM = %d, TEMP = %d° C, GAS = %d \n", HUM_h,  TEMP_h,  mq2);
			//strcpy(out,"OUT :) \n\r");
			//uart_write(myUSART, out, strlen(out));
			if(!mode_conf_wifi_boot && !mode_conf_wifi_user)
			{
				out[0] = '\0';
				strcpy(out,"HUM = ");
				hum_last[0] = '\0';
				itoa(hum_last, 'd', HUM_h); //get_dec_str(tmp, 2, HUM_h);
				strcat(out, hum_last);
				strcat(out, ", TEMP = ");
				temp_last[0] = '\0';
				itoa(temp_last, 'd', TEMP_h); //get_dec_str(tmp, 2,TEMP_h);
				strcat(out, temp_last);
				strcat(out, ", GAS = ");
				mq2_last[0] = '\0';
				itoa(mq2_last, 'd', mq2); //get_dec_str(tmp, 4, mq2);;
				strcat(out, mq2_last);
				strcat(out, "\r\n");
				uart_write(myUSART, out, strlen(out));

				// uodate ThingSpeak
				if(count_thgspk >= THGSPK_CNT_UPDATE) {
					if(wifi_state == AT_DONE)
						 uart_write(espUSART, "AT+CIPSTART=\"TCP\",\"api.thingspeak.com\"," THGSPK_PORT "\r\n", strlen("AT+CIPSTART=\"TCP\",\"api.thingspeak.com\"," THGSPK_PORT "\r\n"));
					else if(wifi_state == AT_READY2SND)
						prepSendWifi() ;
				}
			}

			if(count_thgspk >= THGSPK_CNT_UPDATE)
				count_thgspk = 0;
		}
		else if(ticks == 2000 - 18) {
			ticks = 0;
			GPIO_WriteBit(GPIOA, GPIO_Pin_6, Bit_RESET);
		}
		//GPIO_WriteBit(GPIOC, GPIO_Pin_11, Bit_RESET);  // <-- TEST
	}


