MarcoBodega/MeteoStation-STM32/Demo/main.c
}





//gets the value of BitArray
uint8_t getValueFromOnes(uint8_t start, uint8_t to)
{
	uint8_t value = 0;
	uint8_t bitValue = Ones[start];

	value |= bitValue;
	for(uint8_t i = start; i <= to; i++)
	{
		bitValue = Ones[i];
		bitValue <<= (to - i);
		value |= bitValue;
	}
	return value;
}





/*
MQ-2 normal air output  100
     Isopropile alcohol 540
     Ligther Gas        760
     Benzine            450
     Breath1            150
     Breath2            140
*/

void ADC1_IRQHandler (void)
{
	//GPIO_WriteBit(GPIOC, GPIO_Pin_10, Bit_SET);  // <-- TEST

	// read ADC DR
	mq2 = ADC_GetConversionValue (ADC1);
	ADC_ClearITPendingBit (ADC1 , ADC_IT_EOC );

	//GPIO_WriteBit(GPIOC, GPIO_Pin_10, Bit_RESET);  // <-- TEST
}



// not mandatory
void ADC_Calibrate()
{
	// Check the end of ADC1 reset calibration register
	while ( ADC_GetResetCalibrationStatus (ADC1));
	// Start ADC1 calibration
	ADC_StartCalibration (ADC1);
	// Check the end of ADC1 calibration
	while ( ADC_GetCalibrationStatus (ADC1));

}


/////////////////////////////////
/////////////////////////////////


int strlen(char *s)
{
    char *p = s;
    while (*p != '\0')
        p++;
    return p - s;
}

char *strcpy(char *dst, char *src)
{
    while((*dst++ = *src++)!= '\0')
        ; // <<== Very important!!!
    return dst;
}

int strcmp(const char* s1, const char* s2)
{
    while(*s1 && (*s1==*s2))
        s1++,s2++;
    return *(const unsigned char*)s1-*(const unsigned char*)s2;
}

char *strcat(char *dest, const char *src) 
{
	char *s1 = dest;
	const char *s2 = src;
	char c;

	do {
		c = *s1++;
	} while (c != '\0');

	s1 -= 2;
	do {
		c = *s2++;
		*++s1 = c;
	} while (c != '\0');
	return dest;
}



/** 
 * Convert the integer D to a string and save the string in BUF. If
 * BASE is equal to 'd', interpret that D is decimal, and if BASE is
 * equal to 'x', interpret that D is hexadecimal.
 */
void itoa(char *buf, int base, int d) {
        char *p = buf;
        char *p1, *p2;
        unsigned long ud = d;
        int divisor = 10;

        /* If %d is specified and D is minus, put `-' in the head.  */
        if (base == 'd' && d < 0) {
                *p++ = '-';
                buf++;
                ud = -d;
        } else if (base == 'x') {
                divisor = 16;
        }

        /* Divide UD by DIVISOR until UD == 0.  */
        do {
                int remainder = ud % divisor;

                *p++ = (remainder < 10) ? remainder + '0' : remainder + 'a' - 10;
        } while (ud /= divisor);

        /* Terminate BUF.  */
        *p = 0;

        /* Reverse BUF.  */
        p1 = buf;
        p2 = p - 1;
        while (p1 < p2) {
                char tmp = *p1;
                *p1 = *p2;
                *p2 = tmp;
                p1++;
                p2--;
        }
}


void get_dec_str (uint8_t* str, uint8_t len, uint32_t val)
{
	uint8_t i;
	for(i=1; i<=len; i++)
	{
		str[len-i] = (uint8_t) ((val % 10UL) + '0');
		val/=10;
	}

	str[i-1] = '\0';
}


#ifdef USE_FULL_ASSERT
void assert_failed(uint8_t* file, uint32_t line)
{
    // Infinite loop
    // Use GDB to find out why we're here 
    while (1);
}
#endif



#pragma GCC diagnostic pop

// ----------------------------------------------------------------------------
